
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ДеревоСтруктуры.Колонки.Добавить("Наименование");
	
	СтруктураМетеданных = Новый Структура;
	СтруктураМетеданных.Вставить("Справочники");
	СтруктураМетеданных.Вставить("Документы");
	СтруктураМетеданных.Вставить("Перечисления");
	СтруктураМетеданных.Вставить("Отчеты");
	СтруктураМетеданных.Вставить("Обработки");
	
	Для Каждого ЭлементСтруктуры Из СтруктураМетеданных Цикл
		НоваяСтрока = ДеревоСтруктуры.Строки.Добавить();
		НоваяСтрока.Наименование = ЭлементСтруктуры.Ключ;
		ДобавитьРекурсивно(Метаданные[ЭлементСтруктуры.Ключ], НоваяСтрока);
	КонецЦикла;
	
	
	ЭлементыФормы.ДеревоСтруктуры.Дерево = Истина;
	ЭлементыФормы.ДеревоСтруктуры.СоздатьКолонки();
	

КонецПроцедуры

Процедура ДобавитьРекурсивно(Данные, Родитель)
	
	Для Каждого Объект Из Данные Цикл
		НоваяСтрока = Родитель.Строки.Добавить();
		НоваяСтрока.Наименование = Объект.Имя;
		// Вернется, если не будет что перебирать в цикле
		Попытка
			ДобавитьРекурсивно(Объект.Реквизиты, НоваяСтрока);
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

