
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ДеревоСтруктуры.Колонки.Добавить("Наименование");
	
	ДобавитьРекурсивно(Метаданные.Справочники, ДеревоСтруктуры);
	
	ЭлементыФормы.ДеревоСтруктуры.Дерево = Истина;
	ЭлементыФормы.ДеревоСтруктуры.СоздатьКолонки();
	

КонецПроцедуры

Процедура ДобавитьРекурсивно(Данные, Родитель)
	
	Для Каждого Объект Из Данные Цикл
		НоваяСтрока = Родитель.Строки.Добавить();
		НоваяСтрока.Наименование = Объект.Имя;
		Попытка
			ДобавитьРекурсивно(Объект.Реквизиты, НоваяСтрока);
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

