
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ДеревоСтруктуры.Строки.Очистить();
	
	Для Каждого ЭлементСтруктуры Из СписокОбъектовКонфигурации Цикл
		
		Если НЕ ЭлементСтруктуры.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДеревоСтруктуры.Строки.Добавить();
		НоваяСтрока.Наименование = ЭлементСтруктуры.Значение;
		ДобавитьРекурсивно(Метаданные[ЭлементСтруктуры.Значение], НоваяСтрока);
		
	КонецЦикла;
	
	ЭлементыФормы.ДеревоСтруктуры.Дерево = Истина;
	ЭлементыФормы.ДеревоСтруктуры.СоздатьКолонки();
	

КонецПроцедуры

Процедура ДобавитьРекурсивно(Данные, Родитель)
	
	Для Каждого Объект Из Данные Цикл
		НоваяСтрока = Родитель.Строки.Добавить();
		НоваяСтрока.Наименование = Объект.Имя;
		// Вернется, если не будет что перебирать в цикле
		Попытка
			ДобавитьРекурсивно(Объект.Реквизиты, НоваяСтрока);
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры


Процедура ПриОткрытии()
	
	ДеревоСтруктуры.Колонки.Добавить("Наименование");

	СтруктураМетеданных = Новый Массив;
	СтруктураМетеданных.Добавить("Справочники");
	СтруктураМетеданных.Добавить("Документы");
	СтруктураМетеданных.Добавить("Перечисления");
	СтруктураМетеданных.Добавить("Отчеты");
	СтруктураМетеданных.Добавить("Обработки");
	
	СписокОбъектовКонфигурации.ЗагрузитьЗначения(СтруктураМетеданных);
	
КонецПроцедуры

Процедура СписокОбъектовКонфигурацииВыбор(Элемент, ЭлементСписка)
	
	ЭлементСписка.Пометка = НЕ ЭлементСписка.Пометка 
	
КонецПроцедуры

